[{"title": "Apple TV+ could finally be coming to Android", "author": "Sanuj Bhatia", "authors": ["Sanuj Bhatia"], "journalists": ["Sanuj Bhatia"], "published_date": "2024-05-29 21:35:42", "published_date_precision": "full", "updated_date": "2024-05-29 21:35:42", "updated_date_precision": "full", "link": "https://www.androidpolice.com/apple-tv-plus-could-finally-come-to-android", "domain_url": "androidpolice.com", "full_domain_url": "androidpolice.com", "name_source": "Android Police", "is_headline": false, "paid_content": false, "parent_url": "https://www.androidpolice.com/news", "country": "CA", "rights": "androidpolice.com", "rank": 2955, "media": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2024/05/apple-tv-plus-logo-zoomed.jpg", "language": "en", "description": "After years of exclusivity, the Apple TV+ app could finally be making its way to Android", "content": "Apple TV+ is potentially expanding to Android, tapping into a new audience of around 3.9 billion users.\nThe addition of the Apple TV app to Android could be a strategic move to gain market share in the video streaming industry.\nUnlike other competitors, Apple TV+ offers a single subscription tier with ad-free, high-quality streaming content for $10 a month. Apple TV+ is a home to some of the best TV shows and movies, including hits like Ted Lasso, Severance, and more. However, until now, the Apple TV+ app has been exclusive to the Apple ecosystem, with only limited availability on Android via the Android TV app and the Apple TV+ website.\nThis means Apple has been sitting out on the potential audience of roughly 3.9 billion Android smartphone users (via BankMyCell) due to the lack of a dedicated app. Well, it seems that Apple has finally realized this, as according to a Bloomberg report, Apple is finally bringing its Apple TV+ service as an app to Android.\nRelated Enjoy Apple TV+ movies and shows even when you are offline! The report is based on the job listing posted by Apple in recent days, which says that Apple is looking for a senior Android software engineer to join the Apple TV app team. The engineer, according to the listing, will lead the development of 'fun new features' and 'help build an application used by millions to watch and discover TV and sports.'\nThis suggests that Apple might be warming up to the idea of opening its app to its rival OS, Android, possibly to gain market share in video streaming or due to regulatory pressures like the EU's Digital Markets Act (DMA) that forced Apple to allow sideloading app stores and adopt RCS on iPhone. Whatever the reason, it seems like the Apple TV+ app on Android could become a reality soon.\nApple provides only a handful of apps on Android\nUnlike Google, which offers a large catalog of apps on iOS, Apple has only a few apps available on Android. These include Apple Music, Apple Music Classical, Move to iOS, Tracker Detect, and a few others. While an Apple TV app does exist on the Play Store — in fact, there are two separate listings — this version is only for Android TV and lacks support for phones or tablets. Meanwhile, Apple has declined to release apps like FaceTime and iMessage on Android, but it now seems that Apple TV+ could soon join the list of Apple apps available on Android.\nIn contrast to other streaming services like Netflix, Disney+, or Hulu, which offer ad-supported or lower-quality streaming subscription tiers, Apple TV+ has only a single subscription tier that costs $10 a month. The service is completely ad-free, with most shows available in HDR. With Apple's WWDC 2024 coming up in just over a week, we might get a sneak peek of this Android app at the event — who knows?", "word_count": 491, "is_opinion": false, "twitter_account": "@sanujbhatiaa", "all_links": ["https://www.bloomberg.com/news/articles/2024-05-29/apple-signals-that-it-s-working-on-tv-app-for-android-phones", "https://www.valnetinc.com/en/careers", "https://www.pushbullet.com/channel-popup?tag=androidpolicefeed ", "https://www.instagram.com/sanujbhatia/", "https://www.tiktok.com/@realandroidpolice", "https://twitter.com/AndroidPolice", "https://www.facebook.com/AndroidPolice", "https://www.valnetinc.com/en/privacy-policy", "https://www.valnetinc.com/en/terms-of-use", "https://www.valnetinc.com/en/editorial-integrity", "https://www.linkedin.com/in/sanujbhatia/", "https://www.valnetinc.com/en/advertising", "https://www.bankmycell.com/blog/how-many-android-users-are-there", "https://play.google.com/store/apps/details?id=com.apple.atve.sony.appletv", "https://www.valnetinc.com/en/", "https://jobs.apple.com/en-us/details/200551832/android-software-engineer-apple-tv-app", "https://www.youtube.com/AndroidPolice", "https://twitter.com/sanujbhatiaa/", "https://news.google.com/publications/CAAqBggKMLuYFDDSzAI", "https://play.google.com/store/apps/details?id=com.apple.atve.androidtv.appletv", "https://www.instagram.com/androidpolice/"], "all_domain_links": ["google.com", "tiktok.com", "valnetinc.com", "apple.com", "bloomberg.com", "bankmycell.com", "instagram.com", "pushbullet.com", "twitter.com", "linkedin.com", "facebook.com", "youtube.com"], "id": "dda1ae05b8ac13a262e1508a3947ca50", "score": 10.748032}, {"title": "How to turn off Apple Watch's passcode feature", "author": "Parth Shah", "authors": ["Parth Shah"], "journalists": ["Parth Shah"], "published_date": "2024-04-10 23:42:35", "published_date_precision": "full", "updated_date": "2024-04-10 23:42:35", "updated_date_precision": "full", "link": "https://www.androidpolice.com/apple-watch-turn-off-passcode-tutorial", "domain_url": "androidpolice.com", "full_domain_url": "androidpolice.com", "name_source": "Android Police", "is_headline": true, "paid_content": false, "parent_url": "https://www.androidpolice.com", "country": "CA", "rights": "androidpolice.com", "rank": 2796, "media": "https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2023/10/apple-watch-series-9-9-1.jpg", "language": "en", "description": "Disabling the Apple Watch passcode offers convenience, but it comes with several caveats", "content": "Apple prompts users to add a passcode to their Apple Watch to protect their personal information. When you manually lock the Apple Watch, reboot the system, or remove the wearable from your wrist, you'll enter a passcode to get past the lock screen. If tapping four digits on your Apple Watch screen is inconvenient, use the tips below to turn off a passcode. Although you can use Apple's wearable with an Android phone, we use the iPhone as an example in the guide below.\nIf you frequently wear your Apple Watch in public places, think twice before turning off a critical security feature.\nRelated Apple's watchOS covers all the software that powers the Apple Watch: Here's what's going on What happens when you turn off a passcode on Apple Watch? Before we start, here's what happens when you turn off the passcode on your Apple Watch:\nYou can't use Apple Pay when you turn off the passcode on your wearable. You must pull out your iPhone when you pay someone via Apple Watch.\nAnyone with access to your Apple Watch can glance over your personal data. The person can see your emails, photos, messages, health data, and more without restrictions. It's a privacy nightmare when someone steals your Apple Watch.\nYou can't unlock your Mac with an Apple Watch. You lose some Apple Watch functions when you deactivate the passcode. If you are fine with the limitations, try the tricks below to turn off the Apple Watch passcode feature.\nYou can use the watchOS Settings menu to turn off your Apple Watch passcode. To start, turn on your Apple Watch to open the home screen. Then, tap the Settings gear and scroll to Passcode . On the Passcode screen, tap Turn Passcode Off and enter the current passcode to confirm your decision. Now, instead of entering a passcode, press the crown or swipe up on the lock screen to unlock the Apple Watch.\nSettings gear and scroll to Passcode. On the Passcode screen, tap Turn Passcode Off and enter the current passcode to confirm your decision. Now, instead of entering a passcode, press the crown or swipe up on the lock screen to unlock the Apple Watch.\nIf you don't want to deal with a tiny Apple Watch screen, use the Watch app on your iPhone to make changes. It's your go-to app to manage your Apple Watch like a pro.\nTo check it in action, launch the Watch app on your iPhone and scroll to Passcode . From the following menu, tap Turn Passcode Off . When the Watch app asks you to enter the passcode, enter the four-digit PIN on your Apple Watch.\nWatch app on your iPhone and scroll to Passcode. From the following menu, tap Turn Passcode Off. When the Watch app asks you to enter the passcode, enter the four-digit PIN on your Apple Watch.\nThe Turn Passcode Off feature may be grayed out on your wearable and iPhone. When an organization such as a company or school manages your synced iPhone, the Simple Passcode and Turn Passcode Off buttons are unavailable for your Apple Watch. Your organization deploys a configuration profile with several settings and tweaks on your iPhone and Apple Watch.\nTurn Passcode Off feature may be grayed out on your wearable and iPhone. When an organization such as a company or school manages your synced iPhone, the Simple Passcode and Turn Passcode Off buttons are unavailable for your Apple Watch. Your organization deploys a configuration profile with several settings and tweaks on your iPhone and Apple Watch.\nYou can remove the configuration profile on your iPhone to resolve the problem. But contact your organization first. You should also sign out of the Exchange Mail account you use for work or school. Your school admin's configurations may interfere with the Apple Watch passcode.\nYou'll enter your existing Apple Watch passcode to turn off the functionality. If you forgot your Apple Watch passcode, reset it and set everything from scratch. There are several ways to erase your Apple Watch.\nThe first way is to open Watch on iPhone and tap All Watches . Then, tap i beside your Apple Watch and select Unpair Apple Watch from the following menu. After confirming your decision, your iPhone creates a new backup of your Apple Watch before erasing the data. Pair your Apple Watch from scratch and skip adding a passcode during the setup.\nWatch on iPhone and tap All Watches. Then, tap i beside your Apple Watch and select Unpair Apple Watch from the following menu. After confirming your decision, your iPhone creates a new backup of your Apple Watch before erasing the data. Pair your Apple Watch from scratch and skip adding a passcode during the setup.\nIf you can't access your iPhone, factory reset your Apple Watch from watchOS settings. Go to Settings > General > Reset > Erase All Content and Settings and enter your password when prompted.\nSettings > General > Reset > Erase All Content and Settings and enter your password when prompted.\nIf you mostly wear an Apple Watch at a desk or pull it out once in a while, turning off a passcode feature makes sense. You won't have to remember another passcode for your smart gadget. Apart from these security tweaks, the Apple Watch packs nifty features to keep you productive and healthy.", "word_count": 895, "is_opinion": false, "twitter_account": "@AndroidPolice", "all_links": ["https://twitter.com/AndroidPolice", "https://www.facebook.com/AndroidPolice", "https://www.linkedin.com/in/parth-shah-64022712b/", "https://disqus.com/?ref_noscript", "https://www.instagram.com/androidpolice/", "https://www.youtube.com/AndroidPolice", "https://www.valnetinc.com/", "https://twitter.com/parth2eets", "https://www.tiktok.com/@realandroidpolice", "https://news.google.com/publications/CAAqBggKMLuYFDDSzAI", "https://www.pushbullet.com/channel-popup?tag=androidpolicefeed "], "all_domain_links": ["facebook.com", "twitter.com", "youtube.com", "google.com", "disqus.com", "instagram.com", "linkedin.com", "valnetinc.com", "pushbullet.com", "tiktok.com"], "id": "ff0a3055140ba9f2b736e0f73d9155f0", "score": 10.650061}, {"title": "It looks like Apple is planning to bring Apple TV+ to Android", "author": "Bradly Shankar", "authors": ["Class", "Bradly Shankar", "Display Inline", "Where Img"], "journalists": ["Bradly Shankar"], "published_date": "2024-05-29 21:53:22", "published_date_precision": "full", "updated_date": "2024-05-29 21:54:18", "updated_date_precision": "full", "link": "https://mobilesyrup.com/2024/05/29/apple-tv-app-android", "domain_url": "mobilesyrup.com", "full_domain_url": "mobilesyrup.com", "name_source": "MobileSyrup", "is_headline": true, "paid_content": false, "parent_url": "https://mobilesyrup.com/categories/streaming", "country": "CA", "rights": "mobilesyrup.com", "rank": 15670, "media": "https://cdn.mobilesyrup.com/wp-content/uploads/2024/02/apple-2.jpeg", "language": "en", "description": "Apple is looking to hire a veteran Android engineer to develop what would appear to be the Apple TV app for Google's OS.", "content": "The Apple TV app could be coming to Android devices down the line.\nAs spotted by Bloomberg , Apple is seeking a senior Android engineer to join its Apple TV team. This recruit would be tasked with building 'an application used by millions to watch and discover TV and sports,' suggesting that Apple wants its TV app on Android.\nBloomberg , Apple is seeking a senior Android engineer to join its Apple TV team. This recruit would be tasked with building 'an application used by millions to watch and discover TV and sports,' suggesting that Apple wants its TV app on Android. With a dedicated Apple TV app, Android users would be able to directly access Apple TV+, the Cupertino, California-based tech giant's streaming service, as well as entertainment titles they've rented or purchased from the storefront. Currently, those in the Android ecosystem have to either use tv.apple.com in a web browser or an Android TV device like the Chromecast with Google TV.\nTherefore, a native Apple TV app would more easily reach the millions of people who use Android devices and, in turn, could drive Apple TV+ subscriptions. The Apple TV app is currently available on iPhone, iPad, Mac, Apple TV, Apple Vision Pro, PlayStation and Xbox consoles, select smart TVs and more. Meanwhile, Apple currently only has a small selection of apps on Android, including Apple Music and Beats.\nOf course, an Apple TV app on Android is likely a while away, given that Apple is seemingly still only in the hiring phase. With that in mind, don't expect any sort of news about this at Apple's Worldwide Developers Conference next month.\nSource: Bloomberg", "word_count": 276, "is_opinion": false, "twitter_account": "@bradshankar", "all_links": ["https://www.bloomberg.com/news/articles/2024-05-29/apple-signals-that-it-s-working-on-tv-app-for-android-phones", "https://www.mobilesyrup.planhub.ca/", "https://www.youtube.com/mobilesyrup", "https://www.twitter.com/bradshankar", "https://twitter.com/MobileSyrup", "https://bestbuyca.o93x.net/B0vReB", "https://amzn.to/3J3VJYp", "https://www.instagram.com/mobilesyrup/", "https://www.facebook.com/MobileSyrup/"], "all_domain_links": ["planhub.ca", "instagram.com", "o93x.net", "twitter.com", "facebook.com", "amzn.to", "youtube.com", "bloomberg.com"], "id": "0f4e8d82e3bb9ae9a64667c072e07e22", "score": 10.638421}, {"title": "2024-05-21  NDAQ:AAPL  Press Release", "author": "Stockhouse.com", "authors": ["Stockhouse.com"], "journalists": [], "published_date": "2024-05-21 15:30:53", "published_date_precision": "full", "updated_date": null, "updated_date_precision": null, "link": "https://stockhouse.com/news/press-releases/2024/05/21/apple-and-xce-le-de-france-mobilit-xe9-s-introduce-navigo-card-for-iphone-and", "domain_url": "stockhouse.com", "full_domain_url": "stockhouse.com", "name_source": "Stockhouse", "is_headline": false, "paid_content": false, "parent_url": "https://stockhouse.com/news", "country": "CA", "rights": "stockhouse.com", "rank": 8263, "media": "https://assets.stockhouse.com/kentico-cms/0335-00/images/stockhouse-logo-og.png", "language": "en", "description": "(2024-05-21 | NDAQ:AAPL) Apple and Île-de-France Mobilités introduce Navigo card for iPhone and Apple Watch", "content": "Customers can add a Navigo card to Apple Wallet and simply tap their iPhone or Apple Watch to ride the metro, train, bus, and more in the Paris region\nCustomers can add a Navigo card to Apple Wallet and simply tap their iPhone or Apple Watch to ride the metro, train, bus, and more in the Paris region\nApple® and Île-de-France Mobilités today introduced an easy, secure, and private way for customers to add a new Navigo card to Apple Wallet® and purchase passes to ride transit in the Paris region. Riders can buy passes from the Île-de-France Mobilités iOS app or directly from Apple Wallet, and use an iPhone® or Apple Watch® to tap and ride. Additionally, beginning this week, real-time transit information in Apple Maps is available in Paris to help users navigate their travels throughout the city.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20240521622614/en/\nRiders can buy passes from the Île-de-France Mobilités iOS app or directly from Apple Wallet, and use an iPhone or Apple Watch to tap and ride. (Photo: Business Wire)\n'In the lead-up to what will surely be an amazing summer for the Paris region, we're thrilled to bring Navigo cards to Apple Wallet and provide Parisians and visitors with an incredibly convenient and secure way to ride transit in Paris and explore the city,' said Jennifer Bailey, Apple's vice president of Apple Pay and Apple Wallet. 'Users will love the safety, security, and seamlessness of purchasing passes and riding with a Navigo card in Apple Wallet on iPhone and Apple Watch.'\nAdd a New Navigo Card to Apple Wallet and Buy a Transit Pass\nAdd a New Navigo Card to Apple Wallet and Buy a Transit Pass\nStarting today, users can quickly and easily add a new Navigo card to Wallet by opening the Wallet app, tapping the Add (+) button, selecting 'Transit Card,' and following the instructions. With a Navigo card in Apple Wallet, users no longer need to visit a ticket vending machine or reload a Navigo card at retailers, as they can purchase any pass from the Île-de-France Mobilités iOS app or select passes in Apple Wallet. Riders can purchase t+, t+ reduced price, OrlyBus, RoissyBus tickets, and Navigo Day passes in Apple Wallet by selecting their Navigo card of choice, tapping the More (…) button, and selecting 'Buy Passes.'\nTap to Ride with Navigo Card in Apple Wallet\nTap to Ride with Navigo Card in Apple Wallet\nNavigo cards in Apple Wallet allow for an easy and convenient commuting experience. Users can easily select their Navigo card from Apple Wallet and double-click the side button, or if they have Express Mode enabled, a user can simply hold their iPhone or Apple Watch near a reader to ride transit in Paris without having to unlock or wake up their device.1 With power reserve on iPhone, if a customer's device needs to be charged, they can still use it to ride transit.2\nSecurity and Privacy\nSecurity and Privacy\nNavigo cards in Apple Wallet take full advantage of the privacy and security built into iPhone and Apple Watch. Navigo cards stored in Apple Wallet are private and secure, and Apple never tracks users' journeys. When customers add a Navigo card to Apple Wallet, the card information is encrypted and securely stored in the Secure Element, an industry-standard, certified chip designed to store the information safely on the device. If a user's iPhone or Apple Watch is misplaced, the owner of the device can promptly use the Find My® app to lock and help locate the device.\nReal-Time Transit Updates in Apple Maps\nReal-Time Transit Updates in Apple Maps\nAlso beginning this week, real-time transit information is available in Apple Maps for the Paris metro, RER, Paris tramway, RATP buses, and more. With real-time transit in Maps, users in Paris can see detailed schedules, live departure and arrival times, and system connections to help plan a journey. Apple Maps will now also offer users in Paris important real-time transit information such as outages and delays.\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, AirPods, Apple Watch, and Apple Vision Pro. Apple's six software platforms — iOS, iPadOS, macOS, watchOS, visionOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, iCloud, and Apple TV+. Apple's more than 150,000 employees are dedicated to making the best products on earth and to leaving the world better than we found it.\n1 Express Mode requires iPhone XR or later, or Apple Watch Series 6 or later. Only one Navigo card can be enabled with Express Mode at a time. Additional cards must be manually selected.\n1 Express Mode requires iPhone XR or later, or Apple Watch Series 6 or later. Only one Navigo card can be enabled with Express Mode at a time. Additional cards must be manually selected.\n2 Power reserve is available on iPhone XR or later. Express Mode becomes unavailable when the device is powered off.\n2 Power reserve is available on iPhone XR or later. Express Mode becomes unavailable when the device is powered off.\nNOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or email Apple's Media Helpline at media.help@apple.com.\n© 2024 Apple Inc. All rights reserved. Apple, the Apple logo, Apple Wallet, iPhone, Apple Watch, and Find My are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240521622614/en/", "word_count": 934, "is_opinion": false, "twitter_account": "@stockhouse", "all_links": ["https://www.linkedin.com/company/stockhouse-publishing-ltd", "https://twitter.com/stockhouse", "https://www.facebook.com/stockhouse/", "https://www.linkedin.com/uas/login?session_redirect=https%3A%2F%2Fwww%2Elinkedin%2Ecom%2Fcompany%2Fstockhouse-publishing-ltd&trk=top-card_top-card-secondary-button-top-card-secondary-cta", "https://www.facebook.com/stockhouse", "https://www.businesswire.com/news/home/20240521622614/en/", "https://bit.ly/4bK4nYu", "https://bit.ly/44ItloN", "https://bit.ly/4dMkqa0", "https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apple.com%2Fnewsroom&esheet=54004777&newsitemid=20240521622614&lan=en-US&anchor=www.apple.com%2Fnewsroom&index=1&md5=c60e29e71e639a31b01596f3dd2fe48c"], "all_domain_links": ["twitter.com", "linkedin.com", "businesswire.com", "bit.ly", "facebook.com"], "id": "8b0389c986c8ac51c0b36bfa14db8be9", "score": 10.530569}, {"title": "Rumored New Apple Product Could Be a Throwback to an Abandoned Xbox Peripheral", "author": "John Dicarlo", "authors": ["John Dicarlo", "John Di Carlo"], "journalists": ["John Di Carlo", "John Dicarlo"], "published_date": "2024-04-08 18:11:37", "published_date_precision": "full", "updated_date": "2024-04-08 18:11:37", "updated_date_precision": "full", "link": "https://gamerant.com/apple-tv-built-in-camera-rumor-xbox-kinect", "domain_url": "gamerant.com", "full_domain_url": "gamerant.com", "name_source": "Game Rant", "is_headline": false, "paid_content": false, "parent_url": "https://gamerant.com", "country": "CA", "rights": "gamerant.com", "rank": 5100, "media": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2024/04/apple-logo-on-side-of-building.jpg", "language": "en", "description": "A new report reveals a product that Apple is exploring which will likely remind fans of an infamous Xbox peripheral from years ago.", "content": "Apple may add a built-in camera for FaceTime on future Apple TV, making video calls more seamless.\nApple is considering a redesigned Apple TV with a camera for FaceTime and gesture control.\nThe canceled Apple car project and Vision Pro release may free up resources for new smart home tech. Apple is reportedly exploring a built-in camera to natively support FaceTime in a future Apple TV release, an idea that might remind Xbox fans of the abandoned Kinect. Apple has already added FaceTime support with tvOS 17, which requires a compatible iPhone or iPad to stream a video call to an Apple TV, but this upgrade would make things much more seamless.\nApple is reportedly exploring a built-in camera to natively support FaceTime in a future Apple TV release, an idea that might remind Xbox fans of the abandoned Kinect. Apple has already added FaceTime support with tvOS 17, which requires a compatible iPhone or iPad to stream a video call to an Apple TV, but this upgrade would make things much more seamless. Xbox's Kinect was first launched in 2010 when Microsoft hoped the bold, motion-sensing product would usher in a new generation of home entertainment, and while it sold well initially, its popularity died out due to privacy concerns and a lack of interest from most gamers. The unfortunate timeline ended in 2022 when the Kinect's inventor left Microsoft after allegations of misconduct were levied against him. However, it seems the idea of a camera-enabled entertainment system has found a new home.\nRelated Apple is now allowing the distribution of retro game emulators through the company's App Store, with a few big caveats and conditions. A Bloomberg report states that Apple has big plans for its category of smart home products. Apparently, the tech giant is discussing a redesigned Apple TV set-top box that would include a built-in camera for both FaceTime and gesture control capabilities. Like other Apple products, the technology would be meant to work seamlessly with a user's iPhone or the new Vision Pro. According to the report, Apple has already begun testing a lightweight smart display that is part of this new family of smart home products. The displays would presumably be used as a command center for a user's relevant Apple devices. However, reportedly, the company has not yet decided whether it will move forward with the new products.\nFuture Apple TV Could Have Built-In Camera and Gesture Controls The smart home sector is a wide-reaching and potentially lucrative market for Apple to invest further in, following previous products like the HomePod, but it would have plenty of tough competition from other tech companies like Google, Amazon, and others. However, the report states that Apple's canceled electric car project and recently released Vision Pro have freed up substantial resources to develop future products.\nFor fans interested in forthcoming Apple releases, the company's WWDC24 event takes place on June 10. During it, Apple is expected to announce new software like iOS 18 and macOS 15, but hardware rumors have been scant so far.\nVR or AR fans can already get a taste of the future with Apple's highly expensive Vision Pro, which starts at $3,500 and tops out at almost $5,000 with all accessories included. Some Vision Pro owners have explained that the device is incredibly impressive thanks to its intuitive spatial control features and super precise eye tracking, but also say that the device is almost too ahead of its time, which can be seen in its exorbitant price and inconvenient features like an external battery.\nApple began as a small tech company that evolved into one of the most innovative and well-known brands in all of computing and mobile phones. Their iPhone sees a massive following and they've since spread their umbrella to include streaming services and original productions.", "word_count": 637, "is_opinion": false, "twitter_account": "@gamerant", "all_links": ["https://www.facebook.com/GameRant", "https://twitter.com/gamerant", "https://www.valnetinc.com/odyssey", "https://www.youtube.com/channel/UCkZjsmAQnXfS-_5lwMiXKCQ", "https://www.valnetinc.com", "https://ca.linkedin.com/company/gamerant-com", "https://www.tiktok.com/@gamerantofficial", "https://www.instagram.com/gamerantofficial", "https://flipboard.com/@GameRant", "https://www.bloomberg.com/news/newsletters/2024-04-07/apple-aapl-future-products-could-include-robots-and-smart-home-push-lupinmna?embedded-checkout=true"], "all_domain_links": ["youtube.com", "linkedin.com", "tiktok.com", "instagram.com", "facebook.com", "bloomberg.com", "valnetinc.com", "twitter.com", "flipboard.com"], "id": "ea39d9e15d0d8deefe4d35b610eda8ec", "score": 10.499949}, {"title": "Apple's \"Let Loose\" Special Event: How to Watch It and What to Expect", "author": "Hamlin Rozario", "authors": ["Hamlin Rozario"], "journalists": ["Hamlin Rozario"], "published_date": "2024-04-24 17:00:12", "published_date_precision": "full", "updated_date": "2024-04-24 17:00:12", "updated_date_precision": "full", "link": "https://www.makeuseof.com/apple-let-loose-special-event-details", "domain_url": "makeuseof.com", "full_domain_url": "makeuseof.com", "name_source": "MakeUseOf", "is_headline": true, "paid_content": false, "parent_url": "https://www.makeuseof.com", "country": "CA", "rights": "makeuseof.com", "rank": 1483, "media": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/04/apple-let-loose-event-logo-showing-a-hand-coloring-with-an-apple-pencil.jpg", "language": "en", "description": "Exciting new Apple products are on the horizon.", "content": "Apple announced its first special event for 2024, and unlike the annual software-focused WWDC event it announced in March 2024, this one seems to be all about the iPad. Here's everything you need to know so you can watch the keynote live.\nWhen and How to Watch Apple's \"Let Loose\" Event Apple has scheduled its \"Let Loose\" event for May 7, 2024, at 7 am PT (10 am ET). Although Apple sent invitations to select media and content creators, the invite doesn't mention an in-person component like the upcoming WWDC 2024 event. So, they'll have to watch the keynote online like the rest of us.\nThe invite says you can watch it online on Apple.com, but that's not your only option. You can also watch it directly in the Apple TV app or head to Apple's YouTube channel on May 7, 2024, at 7 am PT, regardless of what device you're using.\nDownload: Apple TV for iOS | Android (Free, in-app purchases available)\nDownload: Apple TV for iOS | Android (Free, in-app purchases available) Will Graf/MakeUseOf\nWill Graf/MakeUseOf While Apple hasn't revealed what it plans to announce at its special event, it's not hard to guess the products that could make an appearance. Take a moment to look at the artistic logo Apple made for the event, and you'll see the Apple Pencil.\nIt's unlikely that Apple will hold an event just to show off a new third-generation Apple Pencil. And considering Apple hasn't introduced any new iPads since late 2022, it's safe to assume this is an iPad-focused event.\nEarlier in March 2024, expert analysts like Bloomberg's Mark Gurman predicted the launch of new iPad Pro models in May. These models are expected to feature all-new OLED displays, M3 chips, and landscape-oriented Face ID cameras in a thinner chassis, which will be tempting to buyers looking for a high-end device.\nAlongside the iPad Pro models, the iPad Air is also expected to get a hardware refresh with the M2 chip. Back in September 2023, Gurman also shared Apple's plans to launch an all-new Magic Keyboard for iPads with an aluminum base in Bloomberg's Power On newsletter. Apple could introduce it alongside the new iPads.\nAs you can see, there's a lot to look forward to at this event. I'm mainly excited to see the redesigned OLED iPads, as the iPad Pro models have all looked nearly the same since 2018.", "word_count": 401, "is_opinion": false, "twitter_account": "@HamlinRozario", "all_links": ["https://www.anrdoezrs.net/links/7251228/type/dlg/sid/UUmuoUeUpU2032098/https://play.google.com/store/apps/details/Apple_TV?id=com.apple.atve.sony.appletv&hl=en_SG", "https://www.bloomberg.com/news/articles/2024-03-28/when-is-the-new-ipad-pro-ipad-air-coming-out-apple-plans-early-may-launch", "https://www.valnetinc.com/", "https://www.youtube.com/muotv", "https://www.bloomberg.com/news/newsletters/2023-09-03/apple-september-12-event-iphone-15-charging-port-change-to-usb-c-from-lightning-lm3gn2hs", "https://flipboard.com/@muo_official", "https://www.youtube.com/watch?v=f1J38FlDKxo", "https://www.apple.com/", "https://apps.apple.com/us/app/apple-tv/id1174078549", "https://www.instagram.com/hamlinrozario/", "https://www.instagram.com/makeuseof_official/", "https://www.facebook.com/muo.official", "https://twitter.com/MUO_official", "https://twitter.com/HamlinRozario", "https://www.pinterest.com/muo_official/", "https://www.apple.com/apple-events/"], "all_domain_links": ["facebook.com", "pinterest.com", "youtube.com", "flipboard.com", "instagram.com", "apple.com", "valnetinc.com", "bloomberg.com", "twitter.com", "anrdoezrs.net"], "id": "002daee0f7e37fb94d1abb65a00918f9", "score": 10.457651}, {"title": "Downtown Montreal Apple Store reportedly moving to 125-year-old heritage building", "author": "Patrick O'Rourke", "authors": ["Patrick O'Rourke"], "journalists": ["Patrick O'Rourke"], "published_date": "2024-04-22 16:03:40", "published_date_precision": "full", "updated_date": "2024-04-22 16:03:40", "updated_date_precision": "full", "link": "https://mobilesyrup.com/2024/04/22/montreal-apple-store-reportedly-move-125-year-old-heritage-building", "domain_url": "mobilesyrup.com", "full_domain_url": "mobilesyrup.com", "name_source": "MobileSyrup", "is_headline": true, "paid_content": false, "parent_url": "https://mobilesyrup.com", "country": "CA", "rights": "mobilesyrup.com", "rank": 13062, "media": "https://cdn.mobilesyrup.com/wp-content/uploads/2024/04/1255-Rue-Sainte-Catherine-montreal.jpg", "language": "en", "description": "A 125-year-old heritage building at 1255 Sainte-Catherine Street West will house the new Apple Store.", "content": "Apple's downtown Montreal Apple Store is reportedly moving to a new location.\nAccording to La Presse , the 125-year-old heritage building at 1255 Sainte-Catherine Street West will house the new Apple Store. The location has been empty for several years after the previous tenant vacated.\nLa Presse , the 125-year-old heritage building at 1255 Sainte-Catherine Street West will house the new Apple Store. The location has been empty for several years after the previous tenant vacated. The current 9,000 sq. ft. downtown Montreal Apple Store that opened in 2008 is located at 1321 Sainte-Catherine Street West. MacRumors says the new Apple store location is just 100 meters from the old one.\nMacRumors says the new Apple store location is just 100 meters from the old one. Apple has not publically revealed plans to relocate its downtown Montreal Apple Store.\nThe Cupertino, California-based tech giant recently moved its Square One Apple Store in Mississauga, Ontario, to a larger location within the mall. It's unclear if Apple's new downtown Montreal Apple Store location will be notably larger than its predecessor.\nImage credit: Loopnet\nImage credit: Loopnet Via: CityNews", "word_count": 186, "is_opinion": false, "twitter_account": "@Patrick_ORourke", "all_links": ["https://www.youtube.com/mobilesyrup", "https://montreal.citynews.ca/2024/04/18/montreal-apple-store-move-downtown/", "https://www.lapresse.ca/affaires/marche-immobilier/2024-04-18/apple-demenage-mais-demeure-rue-sainte-catherine.php", "https://www.instagram.com/mobilesyrup/", "https://www.facebook.com/MobileSyrup/", "https://www.mobilesyrup.planhub.ca/", "https://www.loopnet.com/Listing/1255-Rue-Sainte-Catherine-O-Montr%C3%A9al-QC/22371322/", "https://twitter.com/MobileSyrup", "https://www.twitter.com/Patrick_ORourke", "https://bestbuyca.o93x.net/75gm1V"], "all_domain_links": ["citynews.ca", "facebook.com", "instagram.com", "o93x.net", "twitter.com", "planhub.ca", "youtube.com", "lapresse.ca", "loopnet.com"], "id": "1f09cf88a26818eeb9edd46d9f0e609b", "score": 10.455999}, {"title": "Apple Replaces iTunes on Windows but You Shouldn't Uninstall It Yet", "author": "Hamlin Rozario", "authors": ["Hamlin Rozario"], "journalists": ["Hamlin Rozario"], "published_date": "2024-02-10 11:30:12", "published_date_precision": "full", "updated_date": "2024-02-10 11:30:12", "updated_date_precision": "full", "link": "https://www.makeuseof.com/apple-replaces-itunes-on-windows", "domain_url": "makeuseof.com", "full_domain_url": "makeuseof.com", "name_source": "MakeUseOf", "is_headline": true, "paid_content": false, "parent_url": "https://www.makeuseof.com", "country": "CA", "rights": "makeuseof.com", "rank": 1483, "media": "https://static1.makeuseofimages.com/wordpress/wp-content/uploads/2024/02/person-using-itunes-on-a-windows-pc.jpg", "language": "en", "description": "Think twice before you uninstall iTunes from your Windows PC.", "content": "If you use iTunes to sync or back your iPhone or iPad locally, stream your Apple Music library, or watch Apple TV content, Apple offers new apps to move you away from it. But you might still want to keep iTunes around. Apple's Apps to Replace iTunes Are Available on the Microsoft Store In February 2024, Apple released a trio of Windows apps to phase out iTunes. These include Apple Music, Apple TV, and Apple Devices. This move is similar to how Apple removed iTunes from macOS in 2019. If you're unsure, here's a quick rundown of these Apple apps and what they're useful for: Apple Music: If you've been using iTunes to listen to songs on Apple Music, you'll need this dedicated app. Besides streaming Apple Music content, you can access your entire iCloud Music Library. You can import locally stored songs and store them on iCloud.\nIf you've been using iTunes to listen to songs on Apple Music, you'll need this dedicated app. Besides streaming Apple Music content, you can access your entire iCloud Music Library. You can import locally stored songs and store them on iCloud. Apple TV: If you pay for an Apple TV+ subscription or previously purchased or rented movies on Apple TV, you'll need this app on your Windows PC. Additionally, you can import your own media to the Apple TV app.\nIf you pay for an Apple TV+ subscription or previously purchased or rented movies on Apple TV, you'll need this app on your Windows PC. Additionally, you can import your own media to the Apple TV app. Apple Devices: If you solely relied on iTunes to sync, update, or back up the data on your iPhone, it's time to switch to the Apple Devices app. Also, if you're familiar with creating custom iPhone ringtones using iTunes, Apple Devices should be your go-to from now. Apple's standalone apps for Windows have been available as a preview since January 2023, but they're now available to the general public. Alongside these iTunes replacements, Apple also introduced a revamped iCloud app for Windows users. The release of these standalone Apple apps for Windows devices doesn't mean iTunes is completely useless. You'll still need it if you want to access your audiobooks on your PC or listen to free podcasts. Apple has yet to release a standalone Apple Podcasts app we're familiar with on macOS. When I opened iTunes on my Windows PC, the app prompted me to switch to Apple's standalone apps, and everything was removed except podcasts and audiobooks. However, this wasn't the case for Windows users who downloaded iTunes from the Microsoft Store instead of Apple's iTunes download page. For now, you should think twice before uninstalling iTunes from your Windows computer. If you've never used iTunes to listen to podcasts or audiobooks, you can finally say goodbye and switch to Apple's standalone apps. As an Apple Music subscriber, I'm glad I can now use a sleek-looking desktop app that matches Spotify's offering.", "word_count": 499, "is_opinion": false, "twitter_account": "@HamlinRozario", "all_links": ["https://support.apple.com/downloads/itunes", "https://twitter.com/HamlinRozario", "https://smartmockups.com/mockup/lS60OLaLLp", "https://flipboard.com/@muo_official", "https://www.instagram.com/hamlinrozario/", "https://apps.microsoft.com/detail/9NM4T8B9JQZ1?hl=en-us&gl=US", "https://apps.microsoft.com/detail/9NP83LWLPZ9K?hl=en-US&gl=US", "https://www.pinterest.com/muo_official/", "https://www.youtube.com/muotv", "https://www.facebook.com/muo.official", "https://www.valnetinc.com/", "https://disqus.com/?ref_noscript", "https://apps.microsoft.com/detail/9PFHDD62MXS1?hl=en-US&gl=US", "https://twitter.com/MUO_official", "https://www.instagram.com/makeuseof_official/"], "all_domain_links": ["valnetinc.com", "twitter.com", "smartmockups.com", "youtube.com", "pinterest.com", "instagram.com", "apple.com", "microsoft.com", "disqus.com", "flipboard.com", "facebook.com"], "id": "4ad6a1da68d775e9e97229e0836fbe7c", "score": 10.415761}, {"title": "How to reset an Apple Watch", "author": "Parth Shah", "authors": ["Parth Shah"], "journalists": ["Parth Shah"], "published_date": "2024-05-14 07:53:18", "published_date_precision": "full", "updated_date": "2024-05-14 07:53:18", "updated_date_precision": "full", "link": "https://www.androidpolice.com/how-to-reset-an-apple-watch", "domain_url": "androidpolice.com", "full_domain_url": "androidpolice.com", "name_source": "Android Police", "is_headline": true, "paid_content": false, "parent_url": "https://www.androidpolice.com", "country": "CA", "rights": "androidpolice.com", "rank": 2796, "media": "https://static1.anpoimages.com/wordpress/wp-content/uploads/wm/2024/03/apple-watch-9.jpg", "language": "en", "description": "Fix watchOS glitches or complete ownership transfer by resetting an Apple Watch", "content": "The Apple Watch is one of the best smartwatches available. While Apple frequently updates watchOS with new features and bug fixes, it isn't entirely void of issues. Resetting an Apple Watch is an effective way to troubleshoot stubborn glitches on your wearable. You should also erase an Apple Watch before transferring device ownership to someone else. Here are the top ways to reset an Apple Watch.\nRelated Disabling the Apple Watch passcode offers convenience, but it comes with several caveats When should you reset an Apple Watch? Here are some of the top reasons to reset an Apple Watch:\nIf you plan to sell, loan, or exchange your Apple Watch, unpair and reset it to delete your personal data from the device. This also makes it easier for a new owner to set up and sync their Apple Watch with an iPhone.\nResetting an Apple Watch is handy when fixing annoying problems with your wearable. It saves you a trip to the nearest Apple center. However, it should be the last trick on your list, as setting it up from scratch can be time-consuming.\nDid you forget your Apple Watch passcode? watchOS requires a passcode every day to confirm your identity. You need to reset the watch and set it up again. Do you plan to continue using your Apple Watch? Back up your wearable data for a smooth data restore process. You can back up your iPhone data, and it saves your Apple Watch info, too.\nYou can use the iCloud platform to complete a device backup. If you don't have an active iCloud plan, use iTunes on Windows or Finder on Mac to perform an offline backup. Check our dedicated guide to learn more about backing up an iPhone with or without iCloud.\nYour Apple Watch backup doesn't include Bluetooth pairings, saved credit or debit cards in Apple Pay, Apple Watch Passcode, and Messages.\nWhen you back up your iPhone, it includes Apple Watch data such as app layout on the home screen, clock face settings, general system settings, health and fitness data, notification settings, and more. Visit Apple's official page to learn more.\nThere are a couple of ways to reset an Apple Watch. You can use the Watch app on your iPhone or the watchOS Settings app to make changes.\nOpen the Watch app on iPhone. Tap All Watches at the top. Tap the info (i) button beside your Apple Watch.\nSelect Unpair Apple Watch. Confirm your decision.\nIf you have an Apple Watch with a cellular plan, you have two options. If you plan to use your Apple Watch again, keep your plan. If you don't want to pair your Apple Watch with your iPhone, remove your cellular plan. You should also contact your carrier and cancel the subscription. Enter your Apple ID password to turn off the Activation lock and tap Unpair. Your iPhone creates a backup of your Apple Watch before deleting all content and settings. You can also use the backup file to restore a new wearable.\nYou should also understand the difference between unpairing and resetting an Apple Watch. Unpairing disables the Activation Lock and makes the wearable ready for a new owner. You can also reset an Apple Watch without unpairing it. It's recommended when you plan to pair your Apple Watch with the same iPhone again. Here's how to do it:\nOpen the Watch app and select General. Scroll down to Reset.\nTap Erase Apple Watch Content and Settings. Confirm your decision.\nIf you have an Apple Watch with Cellular, select a relevant option to keep or remove your plan. You can erase Apple Watch content without an iPhone. Go through the steps below to make changes.\nPress the crown button to open the apps list menu. Tap Settings. Select General. Scroll to Reset.\nTap Erase All Content and Settings. Select Erase All from the following menu.\nThe steps above remove all media, data, and settings, but do not remove the Activation Lock. To remove Activation Lock, first unpair the Apple Watch before erasing it.\nIf you encounter watchOS glitches, resetting the Apple Watch should be your last resort. If you plan to sell your Apple Watch, make sure to understand the differences between unpairing and resetting and take the required steps accordingly.\nwatchOS offers a robust set of features for your wearable. Check our top Apple Watch tips and tricks to get the best out of your tiny device on your wrist.", "word_count": 744, "is_opinion": false, "twitter_account": "@parth2eets", "all_links": ["https://www.tiktok.com/@realandroidpolice", "https://www.valnetinc.com/en/privacy-policy", "https://twitter.com/parth2eets", "https://news.google.com/publications/CAAqBggKMLuYFDDSzAI", "https://www.valnetinc.com/en/terms-of-use", "https://www.facebook.com/AndroidPolice", "https://www.valnetinc.com/en/advertising", "https://twitter.com/AndroidPolice", "https://www.valnetinc.com/en/careers", "https://www.youtube.com/AndroidPolice", "https://www.valnetinc.com/en/", "https://www.valnetinc.com/en/editorial-integrity", "https://support.apple.com/en-us/108358", "https://www.instagram.com/androidpolice/", "https://www.linkedin.com/in/parth-shah-64022712b/", "https://www.pushbullet.com/channel-popup?tag=androidpolicefeed "], "all_domain_links": ["youtube.com", "linkedin.com", "facebook.com", "google.com", "pushbullet.com", "tiktok.com", "instagram.com", "valnetinc.com", "apple.com", "twitter.com"], "id": "8d3a4b436ad41a4b4f55662b2e777da4", "score": 10.411957}, {"title": "Apple appeals huge EU fine for music streaming restrictions", "author": "AFP", "authors": ["Dr. Tim Sandle", "AFP", "Paul Wallis"], "journalists": ["Paul Wallis", "Tim Sandle"], "published_date": "2024-05-21 14:55:00", "published_date_precision": "full", "updated_date": "2024-05-21 14:55:09", "updated_date_precision": "full", "link": "https://www.digitaljournal.com/business/apple-appeals-huge-eu-fine-for-music-streaming-restrictions/article", "domain_url": "digitaljournal.com", "full_domain_url": "digitaljournal.com", "name_source": "Digital Journal", "is_headline": true, "paid_content": false, "parent_url": "https://www.digitaljournal.com/business", "country": "CA", "rights": "digitaljournal.com", "rank": 1522, "media": "https://www.digitaljournal.com/wp-content/uploads/2024/05/24213aa8a91d4f23cb411b3df49eeaba0e27693d.jpg", "language": "en", "description": "Apple is challenging a 1.8 billion-euro ($1.9-billion) fine by the European Union for thwarting access to information about cheaper music streaming", "content": "Apple is challenging a 1.8 billion-euro ($1.9-billion) fine by the European Union for thwarting access to information about cheaper music streaming services, an EU court said Tuesday.\nThe iPhone maker filed an appeal with the EU's General Court in Luxembourg on May 16, the court told AFP.\nThe European Commission, the EU's powerful competition regulator, hit Apple with the fine in March in a long-running saga dating back to a 2020 investigation launched after a complaint by Swedish streaming giant Spotify.\nIt was the first ever antitrust fine against Apple by Brussels.\nThe commission said Apple prevented app developers from informing iOS operating system users about cheaper music subscription services available outside the App Store.\nApple had said at the time it would appeal against the penalty.\nThe US tech giant did not wish to comment but pointed to its statement in March in which it said EU regulators had not found evidence of consumer harm.\nA commission spokesperson would not comment on Apple's appeal, but said Brussels 'stands ready to defend all its decisions in court'.\nThe fine is not the only legal tussle between the commission and Apple.\nThe two have butted heads in the EU courts over a 13-billion-euro order on Apple to pay Ireland in back taxes.\nThe case is currently at the bloc's highest court where the commission is appealing against a 2020 decision that annulled the order for Apple to repay the money.\nAnother bone of contention is the EU's new legal armoury to bring big tech to heel.\nWhile Brussels says its Digital Markets Act (DMA) will lead to fairer competition, Apple has criticised the law, saying it risks endangering users' privacy and security.\nThe DMA targets the world's biggest tech companies like Apple but also other firms including Meta and Microsoft, all of which must adhere to a list of obligations.\nThe commission in March launched its first probe into Apple under the DMA.", "word_count": 322, "is_opinion": false, "twitter_account": "@https://twitter.com/afp", "all_links": [], "all_domain_links": [], "id": "bf22f02db4b0cba83d3cc206219d2a6a", "score": 10.406908}]